modm-ext/archive-stmicro-svd/header_stm32l4a6agi6.svd
      <register>
        <name>FGCLUT.19</name>
        <addressOffset>0x44c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.20</name>
        <addressOffset>0x450</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.21</name>
        <addressOffset>0x454</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.22</name>
        <addressOffset>0x458</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.23</name>
        <addressOffset>0x45c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.24</name>
        <addressOffset>0x460</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.25</name>
        <addressOffset>0x464</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.26</name>
        <addressOffset>0x468</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.27</name>
        <addressOffset>0x46c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.28</name>
        <addressOffset>0x470</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.29</name>
        <addressOffset>0x474</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.30</name>
        <addressOffset>0x478</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.31</name>
        <addressOffset>0x47c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.32</name>
        <addressOffset>0x480</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.33</name>
        <addressOffset>0x484</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.34</name>
        <addressOffset>0x488</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.35</name>
        <addressOffset>0x48c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.36</name>
        <addressOffset>0x490</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.37</name>
        <addressOffset>0x494</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.38</name>
        <addressOffset>0x498</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.39</name>
        <addressOffset>0x49c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.40</name>
        <addressOffset>0x4a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.41</name>
        <addressOffset>0x4a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.42</name>
        <addressOffset>0x4a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.43</name>
        <addressOffset>0x4ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.44</name>
        <addressOffset>0x4b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.45</name>
        <addressOffset>0x4b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.46</name>
        <addressOffset>0x4b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.47</name>
        <addressOffset>0x4bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.48</name>
        <addressOffset>0x4c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.49</name>
        <addressOffset>0x4c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.50</name>
        <addressOffset>0x4c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.51</name>
        <addressOffset>0x4cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.52</name>
        <addressOffset>0x4d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.53</name>
        <addressOffset>0x4d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.54</name>
        <addressOffset>0x4d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.55</name>
        <addressOffset>0x4dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.56</name>
        <addressOffset>0x4e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.57</name>
        <addressOffset>0x4e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.58</name>
        <addressOffset>0x4e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.59</name>
        <addressOffset>0x4ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.60</name>
        <addressOffset>0x4f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.61</name>
        <addressOffset>0x4f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.62</name>
        <addressOffset>0x4f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.63</name>
        <addressOffset>0x4fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.64</name>
        <addressOffset>0x500</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.65</name>
        <addressOffset>0x504</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.66</name>
        <addressOffset>0x508</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.67</name>
        <addressOffset>0x50c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.68</name>
        <addressOffset>0x510</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.69</name>
        <addressOffset>0x514</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.70</name>
        <addressOffset>0x518</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.71</name>
        <addressOffset>0x51c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.72</name>
        <addressOffset>0x520</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.73</name>
        <addressOffset>0x524</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.74</name>
        <addressOffset>0x528</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.75</name>
        <addressOffset>0x52c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.76</name>
        <addressOffset>0x530</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.77</name>
        <addressOffset>0x534</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.78</name>
        <addressOffset>0x538</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.79</name>
        <addressOffset>0x53c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.80</name>
        <addressOffset>0x540</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.81</name>
        <addressOffset>0x544</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.82</name>
        <addressOffset>0x548</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.83</name>
        <addressOffset>0x54c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.84</name>
        <addressOffset>0x550</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.85</name>
        <addressOffset>0x554</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.86</name>
        <addressOffset>0x558</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.87</name>
        <addressOffset>0x55c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.88</name>
        <addressOffset>0x560</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.89</name>
        <addressOffset>0x564</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.90</name>
        <addressOffset>0x568</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.91</name>
        <addressOffset>0x56c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.92</name>
        <addressOffset>0x570</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.93</name>
        <addressOffset>0x574</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.94</name>
        <addressOffset>0x578</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.95</name>
        <addressOffset>0x57c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.96</name>
        <addressOffset>0x580</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.97</name>
        <addressOffset>0x584</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.98</name>
        <addressOffset>0x588</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.99</name>
        <addressOffset>0x58c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.100</name>
        <addressOffset>0x590</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.101</name>
        <addressOffset>0x594</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.102</name>
        <addressOffset>0x598</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.103</name>
        <addressOffset>0x59c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.104</name>
        <addressOffset>0x5a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.105</name>
        <addressOffset>0x5a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.106</name>
        <addressOffset>0x5a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.107</name>
        <addressOffset>0x5ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.108</name>
        <addressOffset>0x5b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.109</name>
        <addressOffset>0x5b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.110</name>
        <addressOffset>0x5b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.111</name>
        <addressOffset>0x5bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.112</name>
        <addressOffset>0x5c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.113</name>
        <addressOffset>0x5c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.114</name>
        <addressOffset>0x5c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.115</name>
        <addressOffset>0x5cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.116</name>
        <addressOffset>0x5d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.117</name>
        <addressOffset>0x5d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.118</name>
        <addressOffset>0x5d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.119</name>
        <addressOffset>0x5dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.120</name>
        <addressOffset>0x5e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.121</name>
        <addressOffset>0x5e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.122</name>
        <addressOffset>0x5e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.123</name>
        <addressOffset>0x5ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.124</name>
        <addressOffset>0x5f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.125</name>
        <addressOffset>0x5f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.126</name>
        <addressOffset>0x5f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.127</name>
        <addressOffset>0x5fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.128</name>
        <addressOffset>0x600</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.129</name>
        <addressOffset>0x604</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.130</name>
        <addressOffset>0x608</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.131</name>
        <addressOffset>0x60c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.132</name>
        <addressOffset>0x610</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.133</name>
        <addressOffset>0x614</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.134</name>
        <addressOffset>0x618</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.135</name>
        <addressOffset>0x61c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.136</name>
        <addressOffset>0x620</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.137</name>
        <addressOffset>0x624</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.138</name>
        <addressOffset>0x628</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.139</name>
        <addressOffset>0x62c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.140</name>
        <addressOffset>0x630</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.141</name>
        <addressOffset>0x634</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.142</name>
        <addressOffset>0x638</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.143</name>
        <addressOffset>0x63c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.144</name>
        <addressOffset>0x640</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.145</name>
        <addressOffset>0x644</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.146</name>
        <addressOffset>0x648</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.147</name>
        <addressOffset>0x64c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.148</name>
        <addressOffset>0x650</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.149</name>
        <addressOffset>0x654</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.150</name>
        <addressOffset>0x658</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.151</name>
        <addressOffset>0x65c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.152</name>
        <addressOffset>0x660</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.153</name>
        <addressOffset>0x664</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.154</name>
        <addressOffset>0x668</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.155</name>
        <addressOffset>0x66c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.156</name>
        <addressOffset>0x670</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.157</name>
        <addressOffset>0x674</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.158</name>
        <addressOffset>0x678</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.159</name>
        <addressOffset>0x67c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.160</name>
        <addressOffset>0x680</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.161</name>
        <addressOffset>0x684</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.162</name>
        <addressOffset>0x688</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.163</name>
        <addressOffset>0x68c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.164</name>
        <addressOffset>0x690</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.165</name>
        <addressOffset>0x694</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.166</name>
        <addressOffset>0x698</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.167</name>
        <addressOffset>0x69c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.168</name>
        <addressOffset>0x6a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.169</name>
        <addressOffset>0x6a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.170</name>
        <addressOffset>0x6a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.171</name>
        <addressOffset>0x6ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.172</name>
        <addressOffset>0x6b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.173</name>
        <addressOffset>0x6b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.174</name>
        <addressOffset>0x6b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.175</name>
        <addressOffset>0x6bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.176</name>
        <addressOffset>0x6c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.177</name>
        <addressOffset>0x6c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.178</name>
        <addressOffset>0x6c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.179</name>
        <addressOffset>0x6cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.180</name>
        <addressOffset>0x6d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.181</name>
        <addressOffset>0x6d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.182</name>
        <addressOffset>0x6d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.183</name>
        <addressOffset>0x6dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.184</name>
        <addressOffset>0x6e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.185</name>
        <addressOffset>0x6e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.186</name>
        <addressOffset>0x6e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.187</name>
        <addressOffset>0x6ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.188</name>
        <addressOffset>0x6f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.189</name>
        <addressOffset>0x6f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.190</name>
        <addressOffset>0x6f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.191</name>
        <addressOffset>0x6fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.192</name>
        <addressOffset>0x700</addressOffset>
        <size>0x20</size>
      </register>
